package fitness040420;

public class Logger {
   /* Реализовать возможность вывода информации о посетителях:
    сначала посетителях тренажерного зала, потом бассейна, потом групповых занятий.
    Выводить имя и фамилию посетителей в отсортированном порядке (сначала фамилия, потом имя).

    Реализовать возможность выводить информацию в консоль каждый раз,
    когда клиент посещает фитнес клуб.
    Информация для вывода:
    Фамилия
    Имя
    Вид занятия
    Дата и время посещения
    Методы вывода информации в консоль можно описать в отдельном классе Logger
    (методы можно сделать static)
    */
}
